[
    {
        "episode": "Ep 1: Let You Down",
        "desc": "After a night of streaming illegal braindance, David wakes up to reality: a rundown apartment with a broken washing machine and an overworked mother."
    },
    {
        "episode": "Ep 2: Like A Boy",
        "desc": "With his newly enhanced body, David heads to the Academy seeking revenge on his bully. Later, he meets a mysterious woman who wants to recruit him."
    },
    {
        "episode": "Ep 3: Smooth Criminal",
        "desc": "Surrounded by a group of rowdy edgerunners, David makes a plea to join their team. Meanwhile, sinister forces plot to lure him back to Arasaka Academy."
    },
    {
        "episode": "Ep 4: Lucky You",
        "desc": "Eager to learn the edgerunner ropes, David pesters Maine for another mission. Instead, Maine tasks Lucy with training him."
    },
    {
        "episode": "Ep 5: All Eyez On Me",
        "desc": "David makes a clever suggestion when the team strategizes for their next mission. However, he soon learns that their target can't be underestimated."
    },
    {
        "episode": "Ep 6: Girl on Fire",
        "desc": "Maine doesn't seem to be himself. But the team has bigger fish to fry: They must race against time to extract vital information from their prisoner."
    },
    {
        "episode": "Ep 7: Stronger",
        "desc": "Now an all-star edgerunner enhanced with more cybernetics, David leads his team into a new mission. An old contact reaches out to him for a big job."
    },
    {
        "episode": "Ep 8: Stay",
        "desc": "Faraday finds himself stuck between Arasaka and Militech. Lucy and Rebecca confront David about his change in behavior, but he refuses to listen."
    },
    {
        "episode": "Ep 9: Humanity",
        "desc": "Lucy's captors learn about her secret mission and dark past. David and his team head out to complete Faraday's job but realize that something is off."
    },
    {
        "episode": "Ep 10: My Moon My Man",
        "desc": "On the edge of cyberpsychosis but determined to save Lucy, David storms into Night City as Arasaka plots to deploy their ultimate lethal weapon."
    }
]
