[
    {
        "episode": "Ep 1: Let You Down",
        "desc": "After a night of streaming illegal braindance, David wakes up to reality: a rundown apartment with a broken washing machine and an overworked mother.",
        "synopsis": "In 2076, David Martinez is a young man attending the prestigious Arasaka Academy at his mother Gloria's behest, despite their financial struggle. David illegally modifies his visor to avoid paying for a required update to keep attending class. The modifications crash the school's system, and Gloria agrees to pay for the damages. On their way home from meeting with the headmaster, David engages in a brief argument with his mother, which ends when they are caught in a drive-by shooting between some gang members and a corporate executive's limo. Gloria is left badly wounded but receives care when David manages to access Gloria's savings account to pay for her medical costs. While Gloria is in the hospital, David discovers she stole a military-grade Sandevistan spine implant. David is assaulted by his classmate Katsuo Tanaka, who insults Gloria by insinuating that she earned the money used to pay for David's tuition via prostitution. Following the assault, David learns that Gloria's condition has worsened, and she subsequently dies in the hospital. After Gloria's death, David, who is now completely broke, meets up with Doc, a local ripperdoc who routinely supplies him with illegal braindances (virtual recordings of others' memories) and requests that Doc install the Sandevistan in his body."
    },
    {
        "episode": "Ep 2: Like A Boy",
        "desc": "With his newly enhanced body, David heads to the Academy seeking revenge on his bully. Later, he meets a mysterious woman who wants to recruit him.",
        "synopsis": "Doc agrees to install the Sandevistan, which grants David the ability to undergo a temporary but incredible surge of super speed. Using his new abilities, David returns to school and beats up Katsuo. He does so in full view of the security cameras, resulting in his expulsion from the Academy. Katsuo's father, Mr. Tanaka, an Arasaka executive, notices that David is able to utilize the Sandevistan with no apparent side effects, making him a valuable test subject for Arasaka's latest product. Meanwhile, as David aimlessly wanders the city, he encounters a young woman, Lucy, who agrees to take him on as a partner. After a night of pickpocketing marks on the subway, David collapses due to overuse of the Sandevistan. Lucy takes David back to Doc, who prescribes him immunosuppressants and warns him not to use his Sandevistan more than two or three times a day, regardless of David's unusually high tolerance. Lucy invites David to her apartment, where she confides that her dream is to migrate off-world to the Moon. She shows David a virtual reconstruction of the Moon's surface, but this turns out to be a distraction to sell David out to a gang of edgerunners."
    },
    {
        "episode": "Ep 3: Smooth Criminal",
        "desc": "Surrounded by a group of rowdy edgerunners, David makes a plea to join their team. Meanwhile, sinister forces plot to lure him back to Arasaka Academy.",
        "synopsis": "David is confronted by the gang, led by a man named Maine, who reveals that Gloria had sold the Sandevistan to him a day before her death and that he is one of her acquaintances. David reveals he's Gloria's son and offers to work for Maine, demonstrating his compatibility with the Sandevistan. Intrigued, Maine honors his friendship with Gloria by giving David a chance to prove himself. David then returns home, having lost his trust in Lucy. The next day, David meets up with the gang, and Maine introduces him to the other members: Kiwi, Dorio, and Pilar. David then participates in a heist to steal navigation data from Maxim Kuznetsov, a driver for Arasaka. The plan goes awry due to unexpected complications, and David and Lucy are forced to steal Maxim's limo to gain the data instead. Maine rescues them from Tyger Claw bikers out to claim the fresh bounty placed on their heads by Maxim and, impressed by his performance on the job, officially inducts David into the gang. David also meets Maine's fixer, Faraday, who brings them the job of stealing Maxim's navigation data to obtain information on Tanaka's movements. David then receives a message from the Academy offering to let him return, but he bluntly turns them down."
    },
    {
        "episode": "Ep 4: Lucky You",
        "desc": "Eager to learn the edgerunner ropes, David pesters Maine for another mission. Instead, Maine tasks Lucy with training him.",
        "synopsis": "As a new recruit, David receives training and instruction from the other gang members, including running errands for Pilar and his sister Rebecca, learning how to drive from Maine, and jogging at night with Lucy. He also participates in several jobs with the crew, such as taking out a gang of Scavengers, rescuing Rebecca from the Maelstrom gang, and helping Lucy with pickpocketing. He learns that Lucy is a talented netrunner but not much else about her past. David confides with Maine that he has feelings for Lucy, but he's certain she doesn't feel the same and has trouble figuring out whether he should trust her. Eventually, David begins to feel at home with the gang. However, on the way home from a bar, Pilar begins harassing a homeless man urinating on the street. The homeless man is revealed to have cyberpsychosis and suddenly kills Pilar with a previously concealed arm-mounted launcher. When the cyberpsycho targets Lucy, David uses his Sandevistan to approach the cyberpsycho and shoot him, with Maine finishing him off. David takes Lucy home while the rest of the gang stays behind to deal with the mess, where Lucy reveals that her dream to go to the Moon is genuine. David promises Lucy he will take her to the Moon, and they kiss."
    },
    {
        "episode": "Ep 5: All Eyez On Me",
        "desc": "David makes a clever suggestion when the team strategizes for their next mission. However, he soon learns that their target can't be underestimated.",
        "synopsis": "The gang tries to find more leads on Tanaka, and Kiwi mentions she discovered that he secretly indulges in illicit braindances created by 'JK.' David recognizes the initials as the handle of Jimmy Kurosaki, a famous snuff BD director who also custom-tunes BDs for special clients, including Tanaka, and David explains that Tanaka will have to be present in person for the tuning. Seeing an opportunity to ambush Tanaka, the gang attempts to kidnap JK, but he outwits them, captures David, and flees the scene with Lucy and Dorio in pursuit. JK subjects David to traumatic BDs to induce cyberpsychosis before he is stopped and captured by Lucy and Dorio. With no other choice, JK agrees to lure Tanaka in, but not before cautioning David that the Sandevistan will inevitably make him go cyberpsycho. Tanaka arrives to meet with JK and is subsequently captured, but not before JK is mortally wounded in the crossfire. With a Trauma Team unit incoming, the gang is forced to quickly evacuate with Tanaka, while David remains troubled by JK's words."
    },
    {
        "episode": "Ep 6: Girl on Fire",
        "desc": "Maine doesn't seem to be himself. But the team has bigger fish to fry: They must race against time to extract vital information from their prisoner.",
        "synopsis": "Maine begins developing signs of cyberpsychosis as he starts having trouble controlling his implants, randomly blacks out, hallucinates, and has significant mood swings, culminating in him losing his self-control and suddenly assaulting Kiwi as she tries to hack into Tanaka's cyberware, seriously injuring her. Lucy only agrees to take Kiwi's place provided Maine is kept away and David accompanies her. As Lucy dives into Tanaka's mind, Tanaka regains consciousness and begs David to let him go, telling him that he was responsible for rescinding his expulsion from the Academy, he still has a future there, and that the edgerunners will kill him after they extract his information to tie up loose ends. This causes David to hesitate long enough that Tanaka's neural implant shorts out and kills him, risking killing Lucy, too. Dorio disconnects Lucy safely, but the gang's jammer is disabled, resulting in Trauma Team receiving Tanaka's vitals and en route with the NCPD as support. Maine first sends David and Lucy to their escape vehicle while he and Dorio take Tanaka to distract the authorities. However, during the battle, Maine begins to succumb to his cyberpsychosis, resulting in Dorio's death when she attempts to protect him. David tries to rescue Maine from the heavily armed police forces but can only watch as a regretful Maine blows himself, as well as Dorio and Tanaka's corpses, up, leaving David to flee with Maine's cybernetic arms."
    },
    {
        "episode": "Ep 7: Stronger",
        "desc": "Now an all-star edgerunner enhanced with more cybernetics, David leads his team into a new mission. An old contact reaches out to him for a big job.",
        "synopsis":"A few months after Tanaka's botched kidnapping, David has become the new leader of Maine's edgerunner group, having taken on more implants—including Maine's arm implants—and becoming a renowned edgerunner himself. However, he has been unable to convince Lucy to rejoin the crew. After completing a job for the fixer Wakako Okada to rescue a VIP from the Maelstrom gang, David is approached by Faraday, who offers him a job from Militech against Arasaka as a test to see if he is worthy of inheriting Maine's last job to recover the data Tanaka was hiding. Faraday also requests that David try to recruit Lucy again. Returning home, David talks with Lucy to learn more about her past. She reveals she was part of a special team of child netrunners raised and trained by Arasaka to delve into the Old Net to recover lost data. However, with a high risk of exposure to rogue AIs and malware, the work was hazardous, resulting in much of the team being killed. Eventually, Lucy escaped Arasaka with her teammates, who were all killed the night they left the facility, the group having also murdered their handlers in revenge and ended up in Night City. She also admits that while she used to only worry about herself, she is now more worried about David's health. Later, Lucy kills an Arasaka agent investigating data about a test subject that was 'mysteriously erased' from Tanaka's records."
    },
    {
        "episode": "Ep 8: Stay",
        "desc": "Faraday finds himself stuck between Arasaka and Militech. Lucy and Rebecca confront David about his change in behavior, but he refuses to listen.",
        "synopsis": "Taking on Faraday's job, David kills an Arasaka lab director. Still, he shows signs of cyberpsychosis—during which he murders an innocent staff member who walked in on him killing the director. Meanwhile, Arasaka Counterintelligence is investigating the mysterious deaths of Arasaka personnel. Believing Militech to be involved, they arrange an assassination attempt on Faraday, who narrowly escapes. Due to Faraday's lack of results in recovering data on Arasaka's cyberskeleton project, Militech refuses to protect Faraday any further and he decides to betray them by making contact with Arasaka instead. Arasaka is willing to forgive Faraday for Tanaka's death in return for him tracking down the netrunner responsible for hiding Tanaka's data and killing their agents. Meanwhile, as David's cyberpsychosis conditions worsen, he suffers from trauma over the staff member he killed who reminded him of his mother, as the woman also had a son. Doc recommends that David scale back on his implants and is attacked by David, thus souring their relationship. David once again tries to recruit Lucy, but she insists there's something she has to take care of first and David considers breaking up with her. Lucy then detects another Arasaka agent looking for Tanaka's data and heads over to kill him, only to get captured by Faraday and Kiwi."
    },
    {
        "episode": "Ep 9: Humanity",
        "desc": "Lucy's captors learn about her secret mission and dark past. David and his team head out to complete Faraday's job but realize that something is off.",
        "synopsis": "After interrogating Lucy, Faraday and Kiwi discover that Lucy has been actively hiding Tanaka's data on David as a potential test subject for the cyberskeleton and was responsible for Tanaka's death to ensure his silence. Realizing this, Faraday plans to offer Lucy and David up to Arasaka to secure his position in the company. Faraday assigns David a mission to assault an Arasaka convoy to carry this out. David recruits the help of Kiwi, Rebecca, and Falco, and they manage to seize the convoy's main cargo, which is revealed to be the cyberskeleton itself—a mech-like cyberware that replaces a person's arms and legs. A Militech force then arrives, thanks to a tip from Faraday, who intends to force David to install the cyberskeleton and use it to destroy the Militech force as a demonstration of its power. Kiwi makes her escape as Faraday impersonates Lucy to trick him into installing the cyberskeleton. Lucy is able to escape briefly and warns David about Faraday's duplicity before being recaptured. Angered by the betrayal and Lucy's capture, David uses the cyberskeleton to annihilate the Militech force despite its massive toll on his body. He then tells Rebecca and Falco they will rescue Lucy and get revenge on Faraday."
    },
    {
        "episode": "Ep 10: My Moon My Man",
        "desc": "On the edge of cyberpsychosis but determined to save Lucy, David storms into Night City as Arasaka plots to deploy their ultimate lethal weapon.",
        "synopsis": "After receiving military-grade immunosuppressants from Doc, a deteriorating David fights through Militech, Arasaka, and MaxTac forces as he, Rebecca, and Falco head for Arasaka Tower. Meanwhile, Kiwi has second thoughts about working with Faraday and decides to cut ties with him, so he has her killed as a loose end regarding the cyberskeleton. Before she dies, Kiwi tips off David and the others on Faraday and Lucy's location. Despite his condition worsening after running out of immunosuppressants, David attacks the tower and kills the Arasaka security to rescue Lucy, incapacitating Faraday in the process. Realizing the situation has spiraled out of control, Arasaka deploys their head of security, the legendary cyborg Adam Smasher, to put David down. As David begins succumbing to cyberpsychosis, Lucy kisses him, restoring his sanity. During the fighting, Faraday is thrown to his death by Smasher, who then crushes Rebecca to death and maims Falco. David tasks Falco with getting Lucy to safety while he stays behind to hold off Smasher but, despite having the cyberskeleton, David proves no match for the more experienced Smasher and is torn apart; content with the knowledge that Lucy is safe, David refuses Smasher's offer to become an Arasaka construct and is executed. Sometime later, Lucy fulfills her dream of traveling to the Moon but remains heartbroken as David is not there with her, imagining a vision of him from before he became an edgerunner standing alongside her."
    }
]
